comsys/tcp.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. TCP</a>
<ul>
<li><a href="#sec-1-1">1.1. Congestion Control</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> TCP</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Port-Nummer: \(2^{16} = 65536\)
</li>
</ul>

<p>
TCP zerlegt die zu sendenden Daten in <b>Segmente</b>.
</p>

<ul class="org-ul">
<li>Maximum segment size = 
</li>
</ul>

<p>
Bevor dieselbe Verbindung erneut geöffnet wird muss 2MSL (2 x maximum
segment livetime) gewartet werden, damit die Sequenznummern nicht mit
den Sequenznummern der vorherigen Verbindung kollidieren. Während der
Wartezeit werden die Sequenznummern durch einen timer hochgezählt.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Congestion Control</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>duplicate ACKs: Erneutes versenden eines alten ACKs um den Sender
nach einem bestimmten timeout darpber zu informiern, dass der
Empfänger nichts erhält.
</li>
</ul>
</div>
</div>
</div>
